COOP-5/Designing-Data-Intensive-Applications/01-Reliable-Scalable-and-Maintainable-Applications.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-12 Sun 16:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reliable, Scalable, and Maintainable Applications</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Reliable, Scalable, and Maintainable Applications</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org31c2845">1. Introduction</a></li>
<li><a href="#org4a4a28d">2. Thinking About Data Systems</a></li>
<li><a href="#orgd2ff85f">3. Reliability</a>
<ul>
<li><a href="#orgf9b41d2">3.1. Hardware Faults</a></li>
<li><a href="#orgd20ca1c">3.2. Software Faults</a></li>
<li><a href="#orgba91827">3.3. Human Errors</a></li>
<li><a href="#org904dd6b">3.4. How Important is Reliability?</a></li>
</ul>
</li>
<li><a href="#orgc47a6d5">4. Scalability</a>
<ul>
<li><a href="#org4794bc5">4.1. Describing Load</a></li>
<li><a href="#org5cef350">4.2. Describing Performance</a></li>
<li><a href="#org87136cd">4.3. Approaches for Coping with Load</a></li>
</ul>
</li>
<li><a href="#org1530f4a">5. Maintainability</a>
<ul>
<li><a href="#orgb357751">5.1. Operability: Making Life Easy for Operations</a></li>
<li><a href="#org5ee3731">5.2. Simplicity: Managing Complexity</a></li>
<li><a href="#orge4d0ec9">5.3. Evolvability: Making Change Easy</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org31c2845" class="outline-2">
<h2 id="org31c2845"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Data-intensive applications</b> are built from standard building blocks that provide commonly needed
functionality.
These building blocks include <span class="underline">databases</span>, <span class="underline">caches</span>, <span class="underline">search indexes</span>, <span class="underline">stream processing</span>, and
<span class="underline">batch processing</span>.
</p>

<p>
When building an application, its important to figure out which tools and approaches are most appropriate
for the task at hand.
</p>
</div>
</div>
<div id="outline-container-org4a4a28d" class="outline-2">
<h2 id="org4a4a28d"><span class="section-number-2">2.</span> Thinking About Data Systems</h2>
<div class="outline-text-2" id="text-2">
<p>
In recent years, boundaries between categories of data systems are becoming blurred.
</p>

<p>
Work is broken down into tasks that can be performed efficiently on a single tool, with different tools
stitched together using application code.
</p>

<p>
When combining tools to provide a service, the API hides implementation details from clients.
</p>
</div>
</div>
<div id="outline-container-orgd2ff85f" class="outline-2">
<h2 id="orgd2ff85f"><span class="section-number-2">3.</span> Reliability</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Reliability</b>: the system should continue to work <i>correctly</i> (perform correct function at desired level
of performance) even in the face of <i>adversity</i> (hardware or software faults, even human error)
</p>

<p>
More roughly, reliability means to continue to work correctly, even when things go wrong.
</p>

<p>
<b>Fault</b>: a component of the system deviating from the spec
</p>

<p>
<b>Fault-tolerant/resilient</b>: systems that anticipate faults and can cope with them
</p>

<p>
<b>Failure</b>: when the system as a whole stops providing the required service to the user
</p>

<p>
Impossible to reduce probability of a fault to zero, so best to prevent faults from causing failures.
Generally better to tolerate faults than prevent faults, but must also sometimes prevent faults.
</p>

<p>
One strategy involves deliberately inducing faults.
</p>
</div>
<div id="outline-container-orgf9b41d2" class="outline-3">
<h3 id="orgf9b41d2"><span class="section-number-3">3.1.</span> Hardware Faults</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Hard disks have a mean time to failure (MTTF), so with many disks, some number of disks will die every day.
</p>

<p>
Can add redundancy to individual hardware components to reduce the failure rate of the system (like using
RAID, backup power, etc).
This cannot completely prevent hardware problems from causing failures, but is well understood and has
decent success rate.
</p>

<p>
Redundancy was sufficient in the past since if a backup is restored onto a new machine fairly quickly,
downtime in case of failure is not catastrophic in most applications.
</p>

<p>
As data volumes and computing demands increased, more applications use more machines and so hardware
fault rates have increased.
Platforms are now designed to prioritize flexibility and elasticity over single-machine reliability.
</p>

<p>
Systems should tolerate the loss of entire machines using software and hardware techniques.
</p>
</div>
</div>
<div id="outline-container-orgd20ca1c" class="outline-3">
<h3 id="orgd20ca1c"><span class="section-number-3">3.2.</span> Software Faults</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Hardware faults are generally have no correlation.
</p>

<p>
Systematic errors within the system are correlated across nodes and cause more system failures.
This includes software bugs, runaway processes, slowdowns, and cascading failures.
</p>

<p>
Software faults often lie dormant and are triggered by an unusual set of circumstances.
</p>

<p>
Solutions include:
</p>
<ul class="org-ul">
<li>considering assumptions made</li>
<li>thorough testing</li>
<li>process isolation</li>
<li>monitoring system behaviour</li>
</ul>
</div>
</div>
<div id="outline-container-orgba91827" class="outline-3">
<h3 id="orgba91827"><span class="section-number-3">3.3.</span> Human Errors</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Humans can be unreliable. To mitigate this:
</p>
<ul class="org-ul">
<li>design system to minimize opportunities for error</li>
<li>decouple places where people make mistakes from places where they can cause failures</li>
<li>test thoroughly at all levels</li>
<li>allow quick and easy recovery from human errors</li>
<li>setup detailed and clear monitoring, called <b>telemetry</b></li>
<li>implement good management practices and training</li>
</ul>
</div>
</div>
<div id="outline-container-org904dd6b" class="outline-3">
<h3 id="org904dd6b"><span class="section-number-3">3.4.</span> How Important is Reliability?</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Bugs can have large cost with respect to lost revenue and
reputation damage.
</p>

<p>
Can sacrifice reliability to reduce development cost or
operation cost, but must be conscious of cost cutting.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc47a6d5" class="outline-2">
<h2 id="orgc47a6d5"><span class="section-number-2">4.</span> Scalability</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Scalability</b>: as the system <i>grows</i> (data volume, traffic volume, complexity), there should be reasonable
ways of dealing with growth (cope with increased load)
</p>
</div>
<div id="outline-container-org4794bc5" class="outline-3">
<h3 id="org4794bc5"><span class="section-number-3">4.1.</span> Describing Load</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Load can be described with <b>load parameters</b>.
</p>

<p>
Choice of load parameters depends on the architecture.
</p>

<p>
Choice of average vs worst case depends on specific system.
</p>
</div>
</div>
<div id="outline-container-org5cef350" class="outline-3">
<h3 id="org5cef350"><span class="section-number-3">4.2.</span> Describing Performance</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Can be helpful to examine:
</p>
<ul class="org-ul">
<li>how system performance is affected by increase on load parameter and
keep system resources unchanged</li>
<li>how much resources must be increased with load to keep performance unchanged</li>
</ul>

<p>
This requires a way to describe performance.
</p>

<p>
<b>Throughput</b>: number of records that can be processed per time unit
</p>

<p>
<b>Response time</b>: time between client sending request and receiving a response
</p>

<p>
<b>Latency</b>: duration that a request is waiting to be handled
</p>

<p>
Response time can be considered as a distribution.
Within this distribution, good metrics can be average response time or percentiles
like median, 95th percentile, 99th percentile, etc.
</p>

<p>
<b>Tail latencies</b>: high percentiles of response time, directly affect user
experience
</p>

<p>
Reducing response times at very high percentiles is difficult since they are
affected by random events outside control and benefits are diminishing.
</p>

<p>
Percentiles are used in service level objectives and agreements to define
expected performance and availability.
</p>

<p>
<b>Head-of-line blocking</b>: small number of slow requests holding up subsequent
requests
</p>

<p>
To simulate queues accurately, generate load independently of response time.
</p>

<p>
Even if only a small percentage of backend calls are slow, the chance of
getting a slow call increases if an end-user request requires multiple
backend calls, so a higher proportion of end-user requests end up being
slow (<b>tail latency amplification</b>).
</p>
</div>
</div>
<div id="outline-container-org87136cd" class="outline-3">
<h3 id="org87136cd"><span class="section-number-3">4.3.</span> Approaches for Coping with Load</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Must rethink architecture on every order of magnitude load increase.
</p>

<p>
<b>Shared-nothing architecture</b>: distributing load across
multiple machines
</p>

<p>
<b>Elastic system</b>: can automatically add computing resources when
they detect a load increase (good for unpredictable load)
</p>

<p>
Stateless services are easy to horizontally scale, stateful
services are difficult to.
</p>

<p>
Distributed data systems are default.
The way to scale an architecture is specific to the application.
</p>
</div>
</div>
</div>
<div id="outline-container-org1530f4a" class="outline-2">
<h2 id="org1530f4a"><span class="section-number-2">5.</span> Maintainability</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>Maintainability</b>: over time, everyone that works on the system (maintaining current behaviour
and adapting system to new use cases) should be able to work on it productively
</p>

<p>
Main cost in software is ongoing maintenance.
</p>
</div>
<div id="outline-container-orgb357751" class="outline-3">
<h3 id="orgb357751"><span class="section-number-3">5.1.</span> Operability: Making Life Easy for Operations</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>Operability</b>: make it easy for operations teams to keep system running smoothly
</p>

<p>
Operations teams:
</p>
<ul class="org-ul">
<li>monitor system health</li>
<li>track down problem causes</li>
<li>keep software up to date</li>
<li>keep tabs on system interactions</li>
<li>anticipate future problems</li>
<li>establish good practices and tools for deployment</li>
<li>performance complex maintenance tasks</li>
<li>define processes that make operations predictable</li>
<li>preserve organization knowledge about the system</li>
</ul>

<p>
Good operability means making routine tasks easy, allowing
operations team to focus efforts on high-value activities.
</p>
</div>
</div>
<div id="outline-container-org5ee3731" class="outline-3">
<h3 id="org5ee3731"><span class="section-number-3">5.2.</span> Simplicity: Managing Complexity</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<b>Simplicity</b>: make it easy for new engineers to understand the system by removing
as much complexity as possible from the system
</p>

<p>
As projects get larger, they can become complex and difficult to understand.
</p>

<p>
Reducing complexity greatly improves the maintainability of software.
</p>

<p>
Making a system simpler does not necessarily mean reducing functionality,
it can also mean removing accidental complexity (arises only from
implementation).
</p>

<p>
<b>Abstraction</b> can hide implementation detail behind a clean, simple-to-understand
facade.
</p>
</div>
</div>
<div id="outline-container-orge4d0ec9" class="outline-3">
<h3 id="orge4d0ec9"><span class="section-number-3">5.3.</span> Evolvability: Making Change Easy</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<b>Evolvability</b>: make it easy for engineers to make changes to the system in the
future, adapting it for unanticipated use cases as requirements change
</p>

<p>
Agile working patterns provide a framework for adapting to change.
These include test-driven development and refactoring.
</p>

<p>
The ease with which a system can be adapted to changing requirements is
linked to its simplicity and abstractions.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2025-01-12 Sun 16:21</p>
</div>
</body>
</html>
